Repository: bogdanbabych/0945BUT10201-lex2
Catalog: data/s01rawFiles/gnu-en--de-v03.tmx
Source language: en
Languages: de

source: Freedom 3 includes the freedom to release your modified versions as free software.
de: Freiheit 3 umfasst die Freiheit, eigene modifizierte Versionen als Freie Software freizugeben.

source: A free license may also permit other ways of releasing them; in other words, it does not have to be a copyleft license.
de: Eine freie Lizenz kann auch andere Möglichkeiten der Freigabe zulassen. Mit anderen Worten muss es sich nicht um eine Lizenz mit Copyleft handeln.

source: However, a license that requires modified versions to be nonfree does not qualify as a free license.
de: Allerdings qualifiziert sich eine Lizenz, die von modifizierten Versionen verlangt unfrei zu sein, nicht als freie Lizenz.

source: The freedom to redistribute copies must include binary or executable forms of the program, as well as source code, for both modified and unmodified versions.
de: Die Freiheit, Programmkopien aufs neue zu distribuieren muss binäre oder ausführbare Formen des Programms als auch den Quellcode für modifizierte und unmodifizierte Versionen beinhalten (die Distribution von Programmen in ausführbarer Form ist für bequem installierbare freie Betriebssysteme notwendig).

source: (Distributing programs in runnable form is necessary for conveniently installable free operating systems.) It is OK if there is no way to produce a binary or executable form for a certain program (since some languages don't support that feature), but you must have the freedom to redistribute such forms should you find or develop a way to make them.
de: Es ist in Ordnung, wenn es für bestimmte Anwendungen keine Möglichkeit gibt eine Binärdatei oder ausführbare Form zu erstellen (da einige Programmiersprachen diese Funktion nicht unterstützen), aber man muss die Freiheit haben solche Formen an Dritte weiterzugeben, sollte man eine Möglichkeit finden oder entwickeln, sie zu erstellen.

source: Copyleft Certain kinds of rules about the manner of distributing free software are acceptable, when they don't conflict with the central freedoms.
de: Copyleft Bestimmte Richtlinien über die Art und Weise Freie Software zu distribuieren sind akzeptabel, sofern sie nicht den wesentlichen Freiheiten widersprechen.

source: For example, copyleft (very simply stated) is the rule that when redistributing the program, you cannot add restrictions to deny other people the central freedoms.
de: Copyleft ist beispielsweise (sehr vereinfacht) eine Richtlinie, die verhindert, dass bei einer Redistribution des Programms keine Restriktionen hinzugefügt werden können, um Anderen wesentliche Freiheiten zu versagen.

source: This rule does not conflict with the central freedoms; rather it protects them.
de: Diese Richtlinie widerspricht nicht den wesentlichen Freiheiten ‑ vielmehr schützt es sie.

source: In the GNU project, we use copyleft to protect the four freedoms legally for everyone.
de: Das GNU-Projekt verwendet Copyleft, um die vier Freiheiten rechtlich für jeden zu sichern.

source: We believe there are important reasons why it is better to use copyleft.
de: Wir glauben es gibt wichtige Gründe, warum es besser ist Copyleft zu verwenden.

source: However, noncopylefted free software is ethical too. See Categories of Free Software for a description of how “free software,” “copylefted software” and other categories of software relate to each other.
de: Aber auch Freie Software ohne Copyleft ist ethisch vertretbar (siehe auch Kategorien freier und unfreier Software, wie sich Freie Software, Software mit Copyleft und andere Softwarekategorien aufeinander beziehen).

source: Rules about packaging and distribution details Rules about how to package a modified version are acceptable, if they don't substantively limit your freedom to release modified versions, or your freedom to make and use modified versions privately.
de: Richtlinien über Verpackungs- und Distributionsinformationen Richtlinien, wie man eine modifizierte Version verpacken kann, sind allerdings akzeptabel, sofern sie nicht substantiell die Freiheit einschränken, modifizierte Versionen freizugeben oder modifizierte Versionen privat herzustellen und zu nutzen.

source: Thus, it is acceptable for the license to require that you change the name of the modified version, remove a logo, or identify your modifications as yours.
de: Somit ist es akzeptabel, wenn die Lizenz verlangt den Namen der modifizierten Version zu ändern, ein Logo zu entfernen oder eigene Modifikationen als eigene zu identifizieren.

source: As long as these requirements are not so burdensome that they effectively hamper you from releasing your changes, they are acceptable; you're already making other changes to the program, so you won't have trouble making a few more.
de: Solange diese Bedingungen nicht so aufwändig sind, dass sie die Freigabe der Änderungen effektiv behindern, sind sie zulässig; man nimmt bereits andere Programmänderungen vor, ein paar mehr sollten kein Problem darstellen …

source: Rules that “if you make your version available in this way, you must make it available in that way also” can be acceptable too, on the same condition.
de: Richtlinien wie ‚wenn Sie Ihre Version auf diese Weise zur Verfügung stellen, müssen Sie sie auch auf diese Weise zur Verfügung stellen‘, können unter derselben Bedingung ebenfalls akzeptabel sein.

source: An example of such an acceptable rule is one saying that if you have distributed a modified version and a previous developer asks for a copy of it, you must send one.
de: Solch eine akzeptable Richtlinie wäre beispielsweise dem früheren Entwickler auf dessen Bitte hin eine Kopie der modifizierten und distribuierten Version zukommen lassen zu müssen.

source: (Note that such a rule still leaves you the choice of whether to distribute your version at all.) Rules that require release of source code to the users for versions that you put into public use are also acceptable.
de: [Hinweis: Eine solche Richtlinie lässt immer noch die Wahl, ob man seine Version überhaupt distribuierten möchte.] Ebenfalls sind Richtlinien akzeptabel, die die Freigabe des Quellcodes für öffentlich einsetzbare Programmversionen an Nutzer verlangen.

source: A special issue arises when a license requires changing the name by which the program will be invoked from other programs.
de: Ein besonderes Problem ergibt sich, wenn eine Lizenz die Änderung des Namens erfordert, durch den das Programm aus anderen Programmen aufgerufen wird.

source: That effectively hampers you from releasing your changed version so that it can replace the original when invoked by those other programs.
de: Das behindert wirksam die Freigabe der eigenen geänderten Version, um das Original, wenn durch jenen anderen Programmen aufgerufen, zu ersetzen.

source: This sort of requirement is acceptable only if there's a suitable aliasing facility that allows you to specify the original program's name as an alias for the modified version.
de: Diese Art von Anforderung ist nur dann akzeptabel, wenn es eine geeignete Alias-Funktion gibt, die erlaubt, den Namen des Originalprogramms als Decknamen für die modifizierte Version anzugeben.

source: Export regulations Sometimes government export control regulations and trade sanctions can constrain your freedom to distribute copies of programs internationally.
de: Ausfuhrbestimmungen Mitunter können staatliche Ausfuhrkontrollbestimmungen und Handelssanktionen die Freiheit einschränken, Programmkopien international zu distribuieren.

source: Software developers do not have the power to eliminate or override these restrictions, but what they can and must do is refuse to impose them as conditions of use of the program.
de: Softwareentwickler haben nicht die Macht, diese Restriktionen zu beseitigen oder außer Kraft zu setzen, aber sie können und müssen sich widersetzen sie als Nutzungsbedingungen des Programms aufzuerlegen.

source: In this way, the restrictions will not affect activities and people outside the jurisdictions of these governments.
de: Dadurch betreffen die Restriktionen keine Aktivitäten und Menschen außerhalb der Rechtsordnungen dieser Regierungen.

source: Thus, free software licenses must not require obedience to any nontrivial export regulations as a condition of exercising any of the essential freedoms.
de: Daher dürfen freie Softwarelizenzen keinen Gehorsam gegenüber allen nicht trivialen Ausfuhrbestimmungen als Bedingung für die Ausübung einer der wesentlichsten Freiheiten verlangen.

source: Merely mentioning the existence of export regulations, without making them a condition of the license itself, is acceptable since it does not restrict users.
de: Lediglich die bloße Existenz von Ausfuhrbestimmungen ‑ ohne diese zu einer Bedingung der Lizenz selbst zu machen ‑ ist akzeptabel, da dies keine Nutzer beschränkt.

source: If an export regulation is actually trivial for free software, then requiring it as a condition is not an actual problem; however, it is a potential problem, since a later change in export law could make the requirement nontrivial and thus render the software nonfree.
de: Ist eine Ausfuhrbestimmung tatsächlich für Freie Software trivial, dann ist die erforderliche Bedingung kein tatsächliches Problem; jedoch ist sie ein potenzielles Problem, da eine spätere Änderung im Exportgesetz die Erfordernis trivial und damit die Software unfrei machen könnte.

source: Legal considerations In order for these freedoms to be real, they must be permanent and irrevocable as long as you do nothing wrong; if the developer of the software has the power to revoke the license, or retroactively add restrictions to its terms, without your doing anything wrong to give cause, the software is not free.
de: Rechtliche Hinweise Damit diese Freiheiten wirklich gelten, müssen diese dauerhaft und unwiderruflich sein ‑ solange man nichts Unrechtes anstellt. Sofern Softwareentwickler die Macht haben, die Lizenz zu ihren Bedingungen zu widerrufen oder rückwirkend Restriktionen hinzuzufügen, ohne dafür Anlass gegeben zu haben, ist die Software unfrei.

source: A free license may not require compliance with the license of a nonfree program.
de: Eine freie Lizenz darf nicht die Einhaltung einer Lizenz eines unfreien Programms erforderlich machen.

source: Thus, for instance, if a license requires you to comply with the licenses of “all the programs you use”, in the case of a user that runs nonfree programs this would require compliance with the licenses of those nonfree programs; that makes the license nonfree.
de: Dementsprechend, wenn beispielsweise eine Lizenz die Einhaltung mit den Lizenzen aller genutzten Programme erfordert, würde dies im Falle eines Nutzers, der unfreie Programme ausführt, die Einhaltung mit den Lizenzen dieser unfreien Programme erfordern. Das macht die Lizenz unfrei.

source: It is acceptable for a free license to specify which jurisdiction's law applies, or where litigation must be done, or both.
de: Bei einer freien Lizenz ist die Angabe zulässig, welches Recht anwendbar oder wo Rechtsstreitigkeiten durchgeführt werden müssen oder beides.[**]

source: Contract-based licenses Most free software licenses are based on copyright, and there are limits on what kinds of requirements can be imposed through copyright.
de: Auftragsbezogene Lizenzen Die meisten freien Softwarelizenzen beruhen auf dem Urheberrecht, und es gibt Restriktionen, welche Arten von Anforderungen durch das Urheberrecht auferlegt werden können.

source: If a copyright-based license respects freedom in the ways described above, it is unlikely to have some other sort of problem that we never anticipated (though this does happen occasionally).
de: Wenn eine auf dem Urheberrecht beruhende Lizenz Freiheit auf die oben beschriebene Weise respektiert, ist es unwahrscheinlich eine andere Art von Problem zu haben, dass nicht voraussehbar war (obwohl dies gelegentlich vorkommt).

source: However, some free software licenses are based on contracts, and contracts can impose a much larger range of possible restrictions.
de: Einige freie Softwarelizenzen beruhen allerdings auf Verträgen, und Verträge können eine viel größere Bandbreite möglicher Beschränkungen auferlegen.

source: That means there are many possible ways such a license could be unacceptably restrictive and nonfree.
de: Das bedeutet, es gibt viele Möglichkeiten wie solch eine Lizenz inakzeptabel restriktiv und unfrei sein könnte.

source: We can't possibly list all the ways that might happen.
de: Es ist unmöglich alle Möglichkeiten aufzuführen, die auftreten könnten.

source: If a contract-based license restricts the user in an unusual way that copyright-based licenses cannot, and which isn't mentioned here as legitimate, we will have to think about it, and we will probably conclude it is nonfree.
de: Wenn eine vertragsbasierte Lizenz den Nutzer auf eine ungewöhnliche Weise beschränkt, was auf Urheberrecht beruhende Lizenzen nicht können und welches hier als nicht legitim erwähnt wird, werden wir darüber nachdenken müssen und wahrscheinlich zu dem Schluss kommen, dass sie unfrei ist.

source: Use the right words when talking about free software When talking about free software, it is best to avoid using terms like “give away” or “for free,” because those terms imply that the issue is about price, not freedom.
de: Die richtigen Wörter, wenn es um Freie Software geht Spricht man über Freie Software, empfiehlt es sich Begriffe wie verschenken oder kostenlos zu vermeiden, weil diese Begriffe implizieren, es würde um den Preis gehen, nicht um Freiheit.

source: Some common terms such as “piracy” embody opinions we hope you won't endorse.
de: Einige gebräuchliche Begriffe wie „Piraterie“ stellen Meinungen dar, von denen wir hoffen, dass Sie diese nicht unterstützen.

source: See Confusing Words and Phrases that are Worth Avoiding for a discussion of these terms.
de: Weitere voreingenommene oder irreführende Begriffe unter Zu vermeidende Wörter, ebenso verschiedene Übersetzungen des Begriffs Freie Software.

source: We also have a list of proper translations of “free software” into various languages.
de: Interpretation diese Kriterien Abschließend noch der Hinweis, dass die in dieser Freie-Software-Definition angegeben Kriterien sorgfältige Überlegungen bei ihrer Interpretation erfordern.

source: How we interpret these criteria Finally, note that criteria such as those stated in this free software definition require careful thought for their interpretation.
de: Um zu entscheiden, ob sich eine bestimmte Softwarelizenz als freie Softwarelizenz qualifiziert, beurteilen wir basierend auf diesen Kriterien, ob ihr Geist sowie der genaue Wortlaut passt.

source: To decide whether a specific software license qualifies as a free software license, we judge it based on these criteria to determine whether it fits their spirit as well as the precise words.
de: Enthält eine Lizenz übertriebene Restriktionen, wird sie abgelehnt, auch wenn wir das Problem in diesen Kriterien nicht erwarteten.

source: If a license includes unconscionable restrictions, we reject it, even if we did not anticipate the issue in these criteria.
de: Manchmal spricht eine Lizenzanforderung ein Punkt an, der umfangreiche Überlegungen erfordert, einschließlich Diskussionen mit einem Rechtsanwalt, bevor entschieden werden kann, ob diese Anforderung annehmbar ist.

source: Sometimes a license requirement raises an issue that calls for extensive thought, including discussions with a lawyer, before we can decide if the requirement is acceptable.
de: Wird ein Punkt zum Abschluss gebracht, werden diese Kriterien aktualisiert, um verständlicher zu machen, warum sich bestimmte Lizenzen qualifizieren oder nicht.

source: When we reach a conclusion about a new issue, we often update these criteria to make it easier to see why certain licenses do or don't qualify.
de: Hilfe zu freien Lizenzen Weitere Informationen, ob sich eine bestimmte Lizenz als freie Softwarelizenz qualifiziert, sind unter Verschiedene Lizenzen und Kommentare zu finden.

source: Get help with free licenses If you are interested in whether a specific license qualifies as a free software license, see our list of licenses.
de: Sollte die betreffende Lizenz nicht aufgeführt sein, kontaktieren Sie uns bitte unter <licensing@gnu.org>.

source: If the license you are concerned with is not listed there, you can ask us about it by sending us email at <licensing@gnu.org>.
de: Wenn Sie daran denken eine neue Lizenz zu schreiben, wenden Sie sich bitte zuvor an die Free Software Foundation.

source: If you are contemplating writing a new license, please contact the Free Software Foundation first by writing to that address.
de: Die nur noch schwer überschaubare Ausuferung verschiedener freier Softwarelizenzen bedeutet für Nutzer einen erhöhten Aufwand, die Lizenzen überhaupt zu verstehen.

source: The proliferation of different free software licenses means increased work for users in understanding the licenses; we may be able to help you find an existing free software license that meets your needs.
de: Vielleicht können wir bei der Suche nach einer bereits vorhandenen freien Softwarelizenz behilflich sein, die ihren Bedürfnissen entspricht.

source: If that isn't possible, if you really need a new license, with our help you can ensure that the license really is a free software license and avoid various practical problems.
de: Ist das nicht möglich, wenn tatsächlich eine neue Lizenz benötigt wird, können Sie mit unserer Hilfe sicherstellen, dass die Lizenz wirklich eine freie Softwarelizenz ist und verschiedene praktische Probleme vermeiden.

source: Beyond Software Software manuals must be free, for the same reasons that software must be free, and because the manuals are in effect part of the software.
de: Jenseits von Software Software-Handbücher müssen frei sein, aus den gleichen Gründen, warum Software frei sein muss und weil Handbücher in der Tat Bestandteil der Software sind.

source: The same arguments also make sense for other kinds of works of practical use — that is to say, works that embody useful knowledge, such as educational works and reference works.
de: Die gleichen Argumente sind auch für andere Arten von Werken von praktischem Nutzen sinnvoll ‑ also Werke, die nützliches Wissen verkörpern wie etwa pädagogische Werke und Nachschlagewerke.

source: Wikipedia is the best-known example.
de: Wikipedia ist das wohl bekannteste Beispiel.

source: Any kind of work can be free, and the definition of free software has been extended to a definition of free cultural works applicable to any kind of works.
de: Jegliches Werk kann frei sein, und die Freie-Software-Definition ist zu einer Definition von freien kulturellen Werken erweitert worden, die auf Werke jeglicher Art anwendbar sind.

source: Open Source?
de: „Open Source“, offener Quellcode?

source: Another group uses the term “open source” to mean something close (but not identical) to “free software”.
de: Eine andere Gruppierung verwendet den Begriff „Open Source“ um etwas ähnliches (aber nicht identisches) wie Freie Software zu meinen.

source: We prefer the term “free software” because, once you have heard that it refers to freedom rather than price, it calls to mind freedom.
de: Die Freie-Software-Gemeinschaft bevorzugt den Begriff Freie Software, denn, sobald man gehört hat, dass sich dieser auf Freiheit statt auf den Preis bezieht, ruft es Freiheit in Erinnerung.

source: The word “open” never refers to freedom.
de: Das Wort offen bezieht sich niemals auf Freiheit.

source: History From time to time we revise this Free Software Definition.
de: Historie Von Zeit zu Zeit wird diese Freie-Software-Definition überarbeitet.

source: Here is the list of substantive changes, along with links to show exactly what was changed.
de: Diese substanziellen Änderungen sowie Verweise veranschaulichen genau, was geändert wurde.

source: Version 1.165: Clarify that arbitrary annoyances in the code do not negate freedom 0, and that freedoms 1 and 3 enable users to remove them.
de: Version 1.153: Klarstellung, dass die Freiheit, das Programm auszuführen, bedeutet, dass einen nichts davon abhält es auszuführen.

source: Version 1.153: Clarify that freedom to run the program means nothing stops you from making it run.
de: Version 1.41: Klarstellung, welcher Quellcode unter einer freien Lizenz stehen muss.

source: Version 1.141: Clarify which code needs to be free.
de: Version 1.135: Freiheit 0 ist die Freiheit, das Programm beliebig auszuführen.

source: Version 1.135: Say each time that freedom 0 is the freedom to run the program as you wish.
de: Version 1.134: Freiheit 0 hat nichts mit der Zweckmäßigkeit des Programm zu tun.

source: Version 1.134: Freedom 0 is not a matter of the program's functionality.
de: Version 1.131: Eine freie Lizenz darf nicht die Einhaltung einer unfreien Lizenz eines anderen Programms verlangen.

source: Version 1.131: A free license may not require compliance with a nonfree license of another program.
de: Version 1.129: Klarstellung, dass die Wahl des anwendbaren Rechts und des Gerichtsstandes zulässig sind.

source: Version 1.129: State explicitly that choice of law and choice of forum specifications are allowed.
de: (Das war immer unser Grundsatz.) Version 1.122: Eine Ausfuhrkontrollbestimmung ist ‑ wenn die Bedingung nicht trivial ist ‑ ein echtes Problem; andernfalls nur ein potenzielles Problem.

source: (This was always our policy.) Version 1.122: An export control requirement is a real problem if the requirement is nontrivial; otherwise it is only a potential problem.
de: Version 1.118: Klarstellung, dass sich die Angelegenheit auf das Recht beschränkt modifizieren zu dürfen, nicht darauf welche Modifizierungen vorgenommen wurden.

source: Version 1.118: Clarification: the issue is limits on your right to modify, not on what modifications you have made.
de: Und Modifizierungen sind nicht auf „Verbesserungen“ beschränkt.

source: And modifications are not limited to “improvements” Version 1.111: Clarify 1.77 by saying that only retroactive restrictions are unacceptable.
de: Version 1.111: Klarstellung von 1.77, dass alle rückwirkenden Restriktionen inakzeptabel sind.

source: The copyright holders can always grant additional permission for use of the work by releasing the work in another way in parallel.
de: Die Urheberrechtsinhaber können jederzeit zusätzliche Berechtigung für die Nutzung des Werks dadurch einräumen, das Werk auf eine andere Weise parallel freizugeben.

source: Version 1.105: Reflect, in the brief statement of freedom 1, the point (already stated in version 1.80) that it includes really using your modified version for your computing.
de: Version 1.105: Spiegelt in einer kurzen Darstellung den Punkt von Freiheit 1 wider (bereits in 1.80 erwähnt), dass man tatsächlich die eigene modifizierte Version für die eigene Datenverarbeitung nutzen darf.

source: Version 1.92: Clarify that obfuscated code does not qualify as source code.
de: Version 1.92: Klarstellung, dass sich verschleierter Code nicht als Quellcode qualifiziert.

source: Version 1.90: Clarify that freedom 3 means the right to distribute copies of your own modified or improved version, not a right to participate in someone else's development project.
de: Version 1.90: Klarstellung, dass Freiheit 3 ​​das Recht einräumt, Kopien der eigenen modifizierten oder verbesserten Version zu distribuieren, nicht jedoch die Beteiligung an einem Entwicklungsprojekt bei Dritten.

source: Version 1.89: Freedom 3 includes the right to release modified versions as free software.
de: Version 1.89: Freiheit 3 gewährt das Recht, modifizierte Versionen als Freie Software freizugeben.
